In [1]:
# Conexão com o MySQL
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host='localhost',        # ou IP do servidor MySQL
    user='root',      # substitui pelo teu user do MySQL
    password='',    # substitui pela tua senha
    database='estagio'       # substitui pelo nome da base onde está a tabela empregados
)

print("Conexão estabelecida com sucesso!")

Conexão estabelecida com sucesso!

-- =============================================
-- Consulta: Listar todos os alunos e as empresas onde estão a estagiar
-- Mostra o nome do aluno, o nome da empresa e as datas de início e fim do estágio
-- Ordenado pelo nome do aluno
-- =============================================

In [2]:
query = """
SELECT 
    alunos.nome_aluno AS Aluno,
    empresas.nome_empresa AS Empresa,
    estagioo.data_inicio AS `Início do Estágio`,
    estagioo.data_fim AS `Fim do Estágio`
FROM estagioo
INNER JOIN alunos ON estagioo.id_aluno = alunos.id_aluno
INNER JOIN empresas ON estagioo.id_empresa = empresas.id_empresa
ORDER BY alunos.nome_aluno;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\249663527.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

               Aluno         Empresa Início do Estágio Fim do Estágio
0     Armando Coiton  Illimited work        2025-09-01     2025-12-31
1  Francisca Menezes      ISOF WORLD        2024-05-10     2024-07-15
2          Jorge Lol     Market CEIO        2024-03-15     2024-05-25
3      Lucas Menezes  Illimited work        2025-09-01     2025-12-31
4       Manuel Silva     Market CEIO        2024-06-20     2024-09-01
5        Mento Lopes  Illimited work        2024-04-01     2024-06-30
6         Vulo Ghost      ISOF WORLD        2024-07-01     2024-09-10

-- =============================================
-- Consulta: Listar tutores e os alunos que acompanham
-- Mostra o nome do tutor e o nome do aluno correspondente
-- =============================================

In [3]:
query = """
SELECT 
    tutores.nome_tutor AS "Tutor",
    alunos.nome_aluno AS "Aluno"
FROM estagioo
INNER JOIN tutores 
    ON estagioo.id_tutor = tutores.id_tutor
INNER JOIN alunos 
    ON estagioo.id_aluno = alunos.id_aluno;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\3690807413.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

          Tutor              Aluno
0     Pedro Yow     Armando Coiton
1     Pedro Yow        Mento Lopes
2    Mario Sell          Jorge Lol
3  Marcio Horta      Lucas Menezes
4   Marcia yell       Manuel Silva
5    Lindo Boss  Francisca Menezes
6    Lindo Boss         Vulo Ghost

-- =============================================
-- Consulta: Listar estágios ativos atualmente
-- Mostra o ID do estágio, nome do aluno, curso, empresa, tutor, nota e datas
-- Filtra apenas os estágios que estão a decorrer na data atual
-- =============================================

In [ ]:
query = """
SELECT 
    estagioo.id_estagio AS `ID do Estágio`,
    alunos.nome_aluno AS Aluno,
    cursos.nome_curso AS Curso,
    empresas.nome_empresa AS Empresa,
    tutores.nome_tutor AS Tutor,
    avaliacao.nota AS Nota,
    estagioo.data_inicio AS `Início do Estágio`,
    estagioo.data_fim AS `Fim do Estágio`
FROM estagioo
INNER JOIN alunos 
    ON estagioo.id_aluno = alunos.id_aluno
INNER JOIN cursos 
    ON alunos.id_curso = cursos.id_curso
INNER JOIN empresas 
    ON estagioo.id_empresa = empresas.id_empresa
INNER JOIN tutores 
    ON estagioo.id_tutor = tutores.id_tutor
INNER JOIN avaliacao 
    ON estagioo.id_aval = avaliacao.id_aval
WHERE CURDATE() BETWEEN estagioo.data_inicio AND estagioo.data_fim;
"""

df = pd.read_sql(query, conn)
df
#Ou seja: nenhum estágio está a decorrer hoje (CURDATE() não está entre data_inicio e data_fim).")
#Por isso nao obtivemos nenhuma saida

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\4151630465.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

Empty DataFrame
Columns: [ID do Estágio, Aluno, Curso, Empresa, Tutor, Nota, Início do Estágio, Fim do Estágio]
Index: []

### Consulta: Listar todos os estágios com detalhes completos

Esta query retorna informações completas sobre todos os estágios, incluindo:

- **Empresa**: Nome da empresa onde o estágio ocorre  
- **ID do Estágio**: Identificador único do estágio  
- **Aluno**: Nome do aluno que está a realizar o estágio  
- **Curso**: Curso do aluno  
- **Tutor**: Nome do tutor responsável  
- **Nota**: Nota final do estágio  
- **Início do Estágio**: Data de início do estágio  
- **Fim do Estágio**: Data de término do estágio  

Os resultados são **ordenados primeiro pelo nome da empresa e depois pelo ID do estágio**.

In [5]:
query = """
SELECT 
    empresas.nome_empresa AS Empresa,
    estagioo.id_estagio AS `ID do Estágio`,
    alunos.nome_aluno AS Aluno,
    cursos.nome_curso AS Curso,
    tutores.nome_tutor AS Tutor,
    avaliacao.nota AS Nota,
    estagioo.data_inicio AS `Início do Estágio`,
    estagioo.data_fim AS `Fim do Estágio`
FROM estagioo
INNER JOIN alunos 
    ON estagioo.id_aluno = alunos.id_aluno
INNER JOIN cursos 
    ON alunos.id_curso = cursos.id_curso
INNER JOIN empresas 
    ON estagioo.id_empresa = empresas.id_empresa
INNER JOIN tutores 
    ON estagioo.id_tutor = tutores.id_tutor
INNER JOIN avaliacao 
    ON estagioo.id_aval = avaliacao.id_aval
ORDER BY empresas.nome_empresa, estagioo.id_estagio;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\953495090.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

,Empresa,ID do Estágio,Aluno,Curso,Tutor,Nota,Início do Estágio,Fim do Estágio
0,Illimited work,1,Lucas Menezes,Folha de Cálculo,Marcio Horta,17.0,2025-09-01,2025-12-31
1,Illimited work,2,Armando Coiton,Gestão de Informação,Pedro Yow,15.0,2025-09-01,2025-12-31
2,Illimited work,4,Mento Lopes,Folha de Cálculo,Pedro Yow,10.0,2024-04-01,2024-06-30
3,ISOF WORLD,5,Francisca Menezes,Análise de Dados,Lindo Boss,9.0,2024-05-10,2024-07-15
4,ISOF WORLD,7,Vulo Ghost,Inglês,Lindo Boss,18.0,2024-07-01,2024-09-10
5,Market CEIO,3,Jorge Lol,Matematica,Mario Sell,12.0,2024-03-15,2024-05-25
6,Market CEIO,6,Manuel Silva,Inglês,Marcia yell,14.0,2024-06-20,2024-09-01

### Consulta: Total de estágios por empresa

Esta query retorna o **número total de estágios realizados em cada empresa**:

- **Empresa**: Nome da empresa  
- **Total de Estágios**: Quantidade de estágios realizados nessa empresa  

Os resultados são **ordenados do maior para o menor número de estágios**.

In [6]:
query = """
SELECT 
    empresas.nome_empresa AS Empresa,
    COUNT(estagioo.id_estagio) AS `Total de Estágios`
FROM estagioo
INNER JOIN empresas 
    ON estagioo.id_empresa = empresas.id_empresa
GROUP BY empresas.nome_empresa
ORDER BY `Total de Estágios` DESC;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\301510222.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

          Empresa  Total de Estágios
0  Illimited work                  3
1     Market CEIO                  2
2      ISOF WORLD                  2

### Consulta: Média das notas dos estágios por empresa

Esta query retorna a **média das notas dos estágios** para cada empresa:

- **Empresa**: Nome da empresa  
- **Média das Notas**: Média das avaliações dos estágios, arredondada para 2 casas decimais  

Os resultados são **ordenados da maior para a menor média de notas**.

In [7]:
query = """
SELECT 
    empresas.nome_empresa AS Empresa,
    ROUND(AVG(avaliacao.nota), 2) AS `Média das Notas`
FROM estagioo
INNER JOIN empresas 
    ON estagioo.id_empresa = empresas.id_empresa
INNER JOIN avaliacao 
    ON estagioo.id_aval = avaliacao.id_aval
GROUP BY empresas.nome_empresa
ORDER BY `Média das Notas` DESC;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\775643315.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

          Empresa  Média das Notas
0  Illimited work             14.0
1      ISOF WORLD             13.5
2     Market CEIO             13.0

### Consulta: Média combinada entre nota do curso e nota do estágio

Esta query calcula a **média entre a nota do curso e a nota final do estágio** para cada aluno:

- **Aluno**: Nome do aluno  
- **Curso**: Nome do curso do aluno  
- **Nota do Curso**: Nota obtida pelo aluno no curso  
- **Nota da Avaliação**: Nota obtida no estágio  
- **Média Combinada**: Média entre a nota do curso e a nota do estágio, arredondada para 2 casas decimais  

Os resultados são **ordenados da maior para a menor média combinada**.

In [8]:
query = """
SELECT 
    alunos.nome_aluno AS Aluno,
    cursos.nome_curso AS Curso,
    alunos.nota_curso AS `Nota do Curso`,
    avaliacao.nota AS `Nota da Avaliação`,
    ROUND((alunos.nota_curso + avaliacao.nota) / 2, 2) AS `Média Combinada`
FROM estagioo
INNER JOIN alunos 
    ON estagioo.id_aluno = alunos.id_aluno
INNER JOIN cursos 
    ON alunos.id_curso = cursos.id_curso
INNER JOIN avaliacao 
    ON estagioo.id_aval = avaliacao.id_aval
ORDER BY `Média Combinada` DESC;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\1576230965.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

,Aluno,Curso,Nota do Curso,Nota da Avaliação,Média Combinada
0,Lucas Menezes,Folha de Cálculo,18.00,17.0,17.50
1,Armando Coiton,Gestão de Informação,13.10,15.0,14.05
2,Manuel Silva,Inglês,14.00,14.0,14.00
3,Vulo Ghost,Inglês,9.00,18.0,13.50
4,Mento Lopes,Folha de Cálculo,16.56,10.0,13.28
5,Jorge Lol,Matematica,12.23,12.0,12.12
6,Francisca Menezes,Análise de Dados,12.50,9.0,10.75

### Consulta: Total de alunos por tutor e empresa

Esta query retorna o **número de alunos que cada tutor acompanha em cada empresa**:

- **Empresa**: Nome da empresa  
- **Tutor**: Nome do tutor  
- **Total de Alunos**: Quantidade de alunos supervisionados pelo tutor na empresa  

Os resultados são **ordenados do maior para o menor número de alunos**.

In [9]:
query = """
SELECT 
    empresas.nome_empresa AS Empresa,
    tutores.nome_tutor AS Tutor,
    COUNT(estagioo.id_estagio) AS `Total de Alunos`
FROM estagioo
INNER JOIN tutores 
    ON estagioo.id_tutor = tutores.id_tutor
INNER JOIN empresas 
    ON tutores.id_empresa = empresas.id_empresa
GROUP BY empresas.nome_empresa, tutores.nome_tutor
ORDER BY `Total de Alunos` DESC;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\4020570238.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

          Empresa         Tutor  Total de Alunos
0  Illimited work     Pedro Yow                2
1      ISOF WORLD    Lindo Boss                2
2     Market CEIO    Mario Sell                1
3      ISOF WORLD  Marcio Horta                1
4     Market CEIO   Marcia yell                1

### Consulta: Alunos com nota do estágio inferior a 12

Esta query retorna todos os alunos que **obtiveram nota inferior a 12 na avaliação do estágio**:

- **Aluno**: Nome do aluno  
- **Curso**: Curso do aluno  
- **Nota**: Nota obtida na avaliação do estágio  

Os resultados são **ordenados pelo nome do curso e depois pela nota em ordem crescente**.

In [10]:
query = """
SELECT 
    alunos.nome_aluno AS Aluno,
    cursos.nome_curso AS Curso,
    avaliacao.nota AS Nota
FROM estagioo
INNER JOIN alunos 
    ON estagioo.id_aluno = alunos.id_aluno
INNER JOIN cursos 
    ON alunos.id_curso = cursos.id_curso
INNER JOIN avaliacao 
    ON estagioo.id_aval = avaliacao.id_aval
WHERE avaliacao.nota < 12
ORDER BY cursos.nome_curso, Nota ASC;
"""

df = pd.read_sql(query, conn)
df

C:\Users\HP\AppData\Local\Temp\ipykernel_32136\4222955279.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

               Aluno             Curso  Nota
0  Francisca Menezes  Análise de Dados   9.0
1        Mento Lopes  Folha de Cálculo  10.0